<template>
<div class="container" v-title="'“TaTu课堂”教师用户注册协议'">
	<section>
		<div class="title">
			<div class="line"></div>
			<h1>一、总则</h1>
		</div>
		<p>1.1 “TaTu课堂”的所有权和运营权归深圳市它途文化有限公司所有。</p>  
		<p>1.2 用户在使用“TaTu课堂”服务前，已仔细阅读《“TaTu课堂”用户注册协议》（以下简称“本协议”）的全部内容，对于本协议各项条款已充分理解。</p> 
		<p>1.3用户同意本协议的全部条款并按照页面上的提示完成全部的注册程序。用户在进行注册程序过程中点击"注册"按钮即表示用户与“TaTu课堂”达成以下协议：完全接受本协议项下的全部条款，本协议即在用户与“TaTu课堂”之间产生法律效力，对双方均具有法律约束力。</p> 
		<p>1.4“TaTu课堂”的用户协议、各项服务条款、全部活动规则及通知、公告、声明等，均为本协议不可分割的组成部分。用户在使用“TaTu课堂”提供的各项服务之前，应仔细阅读本协议及本协议不可分割的各项内容。用户在使用相关服务时,应关注并遵守其所适用的相关条款。</p> 
		<p>1.5 “TaTu课堂”有权对协议进行不定期修订、更新。修改后的协议一经公布即有效替代原有协议，新协议公布时用户可随时查询最新协议。用户如不同意修改内容，可以主动与“TaTu课堂”进行协商，双方达成谅解；用户一旦使用“TaTu课堂”服务，即视为用户已了解并完全同意本协议及其他服务条款中的各项内容，包括“TaTu课堂”对本协议及其他服务条款所做的任何修改，协议及/或协议的修改将在用户与“TaTu课堂”之间产生法律效力。</p> 

		<div class="title" style="margin-top:.3rem">
			<div class="line"></div>
			<h1>二、用户注册</h1>
		</div>
		<p>2.1 学员用户（本协议简称“用户”）：指与“TaTu课堂”达成教学共识，并来“TaTu课堂”接受学习教育的学生，本人及其监护人接受并同意“TaTu课堂”全部条款，并完成“TaTu课堂”平台注册程序，获得可以登陆“TaTu课堂”会员系统权限的正式注册会员。</p> 
		<p>2.2 用户如未满18周岁，须经监护人同意或由法定代理人代理，或是得到有权主体授权后进行注册、交易。本协议项下学员所作出的所有同意、承诺、确认、授权均视同由该监护人作出，对该监护人有约束力。</p> 
		<p>2.3 用户使用“TaTu课堂”提供的互联网平台服务前，应做以下准备：</p> 
		<p>(1)“TaTu课堂”提供公共网络，用户需自行配备上网的所需设备，包括个人电脑、移动设备等；</p> 
		<p>(2)如不使用“TaTu课堂”所提供网络，用户需自行负担个人上网所支付的与此服务有关的电话费用、网络费用等。</p> 
		<p>2.4 用户点击“同意以下协议并注册”按钮，则视为用户同意本协议的所有条款，且具有浏览“TaTu课堂”平台相关信息、提交个人资料、查看教学计划、发表评价、续费申请等使用“TaTu课堂”提供的学员用户全部服务的权利能力和行为能力，同意承担由此带来的全部法律责任。</p> 
		<p>2.5 用户注册、使用“TaTu课堂”不得出于非法或破坏“TaTu课堂”正常运营的目的，用户保证向“TaTu课堂”提交的全部信息均为本人真实、准确、有效和完整的信息，不存在盗用、借用、买入非本人手机号码、电子邮箱等进行注册、欺诈和作弊的行为，用户若存在上述违规行为，“TaTu课堂”有权取消其“TaTu课堂”学员资格，并停止服务、封停帐号且以后也不再向其提供服务。如该违规行为给“TaTu课堂”造成损失的，“TaTu课堂”保留追究赔偿及诉至法律解决的权利。</p> 
		<p>2.6 用户注册成功后，应妥善保管其“TaTu课堂”平台帐户及密码，定期或不定期修改密码，在每次使用“TaTu课堂”服务完毕后及时退出帐户，以确保帐户安全。用户应对其“TaTu课堂”注册账号和密码下进行的行为和发生的事件负责。用户不得将“TaTu课堂”平台帐户出借、转让或用作其他非法用途，否则因帐户未妥善保管而造成损失的，用户应承担相应法律责任，除非有证据证明该行为与用户无关。若用户因“TaTu课堂”平台帐户被盗或因其他非用户原因造成损失的，用户应立即通知“TaTu课堂”并向公安机关报案。</p> 

		<div class="title" style="margin-top:.3rem">
			<div class="line"></div>
			<h1>三、服务内容</h1>
		</div>
		<p>3.1 “TaTu课堂”的具体内容由深圳市它途文化有限公司根据实际情况提供。</p>  
		<p>3.2 “TaTu课堂”为学员用户提供相关的网络平台服务，包括课程查看、消息提醒、个人中心等模块内容，以及今后平台升级所添加到新功能模块内容，每项模块有单独使用说明及协议条款。</p> 
		<p>3.3 用户在使用相关平台服务时可免费使用“TaTu课堂”所提供网络。但需准备与相关网络服务有关的设备(如个人电脑、手机、及其他与接入互联网或移动网有关的装置)。</p> 


		<div class="title" style="margin-top:.3rem">
			<div class="line"></div>
			<h1>四、行为规范</h1>
		</div>
		<p>遵守中华人民共和国相关法律法规，包括但不限于《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《最高人民法院关于审理涉及计算机网络著作权纠纷案件适用法律若干问题的解释(法释[2004]1号)》、《全国人大常委会关于维护互联网安全的决定》、《互联网电子公告服务管理规定》、《互联网新闻信息服务管理规定》、《互联网著作权行政保护办法》和《信息网络传播权保护条例》等有关计算机互联网规定和知识产权的法律和法规、实施办法。</p>
		<p>4.2 用户对其自行发表、上传或传送的内容负全部责任，所有用户不得在“TaTu课堂”任何页面发布、转载、传送含有下列内容之一的信息，否则“TaTu课堂”管理员有权封闭用户账号：</p>
		<p>&nbsp(1) 违反宪法确定的基本原则的； </p>
		<p>&nbsp(2) 危害国家安全，泄漏国家机密，颠覆国家政权，破坏国家统一的； </p>
		<p>&nbsp(3) 损害国家荣誉和利益的； </p>
		<p>&nbsp(5) 破坏国家宗教政策，宣扬邪教和封建迷信的； </p>
		<p>&nbsp(6) 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
		<p>&nbsp(7) 散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；</p> 
		<p>&nbsp(8) 侮辱或者诽谤他人，侵害他人合法权益的； </p>
		<p>&nbsp(9) 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；</p> 
		<p>&nbsp(10) 以非法民间组织名义活动的；</p>
		<p>&nbsp(11) 含有法律、行政法规禁止的其他内容的。</p>
		<p>4.3 用户承诺对其发表或者上传于“TaTu课堂”的所有信息(即属于《中华人民共和国著作权法》规定的作品，包括但不限于文字、图片、音乐、电影、表演和录音录像制品和电脑程序等)均享有完整的知识产权，或者已经得到相关权利人的合法授权；如用户违反本条规定造成“TaTu课堂”被第三人索赔的，用户应全额补偿本公司一切费用(包括但不限于各种赔偿费、诉讼代理费及为此支出的其它合理费用)；</p> 
		<p>4.4 用户应遵守以下规定：</p>
		<p>&nbsp(1) 不得为任何非法目的而使用网络服务系统； </p>
		<p>&nbsp(2) 遵守所有与网络服务有关的网络协议、规定和程序； </p>
		<p>&nbsp(3) 不得利用“TaTu课堂”进行任何可能对互联网的正常运转造成不利影响的行为； </p>
		<p>&nbsp(4) 不得利用“TaTu课堂”进行任何不利于深圳市它途文化有限公司的行为。</p>
		<p>4.5 如用户在使用网络服务时违反上述任何规定，“TaTu课堂”管理员有权要求用户改正或直接采取一切必要的措施(包括但不限于删除用户上传的内容、暂停或终止用户使用网络服务的权利)以减轻用户不当行为而造成的影响。</p>
		<div class="title" style="margin-top:.3rem">
			<div class="line"></div>
			<h1>五、行为规范</h1>
		</div>
		<p>5.1 “TaTu课堂”不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在本站的非公开内容，但下列情况除外：</p>
		<p>&nbsp(1) 事先获得用户的明确授权； </p>
		<p>&nbsp(2) 根据有关的法律法规要求；</p>
		<p>&nbsp(3) 按照相关政府主管部门的要求；</p>
		<p>&nbsp(4) 为维护社会公众的利益。</p>
		<p>5.2 “TaTu课堂”可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与“TaTu课堂”同等的保护用户隐私的责任，则“TaTu课堂”有权将用户的注册资料等提供给该第三方。</p>
		<p>5.3 在不透露单个用户隐私资料的前提下，“TaTu课堂”有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p>
		<div class="title" style="margin-top:.3rem">
			<div class="line"></div>
			<h1>六、版权声明</h1>
		</div>
		<p>6.1 “TaTu课堂”的文字、图片、音频、视频等版权均归深圳市它途文化有限公司享有或与作者共同享有，未经公司许可，不得任意转载。</p> 
		<p>6.2 “TaTu课堂”特有的标识、版面设计、编排方式等版权均属深圳市它途文化有限公司享有，未经公司许可，不得任意复制或转载。</p> 
		<p>6.3 “TaTu课堂”享有所有作品用于其它用途的优先权，包括但不限于网站、电子杂志、平面出版等，但在使用前会通知作者，取得作者同意。</p>
		<p>6.4 用户不得发布任何侵犯他人著作权、商标权等知识产权或其他合法权利的内容（获得授权情况除外）；如果发生上述行为导致第三方索赔或诉讼，用户应承担全部责任。</p>
		<div class="title" style="margin-top:.3rem">
			<div class="line"></div>
			<h1>七、责任声明</h1>
		</div>
		<p>7.1 对于因不可抗力或本站不能控制的原因造成的网络服务中断或其它缺陷，“TaTu课堂”不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</p>
		<p>7.2 对于“TaTu课堂”向用户提供的下列服务的质量缺陷本身及其引发的任何损失，“TaTu课堂”无需承担任何责任：</p>
		<p>&nbsp(1) “TaTu课堂”向用户免费提供的各项网络服务； </p>
		<p>&nbsp(2) “TaTu课堂”向用户赠送的任何产品或者服务。</p>
		<p>7.3 “TaTu课堂”有权于任何时间暂时或永久修改或终止本服务(或其任何部分)，而无论其通知与否，“TaTu课堂”对用户和任何第三人均无需承担任何责任。</p>
		<div class="title" style="margin-top:.3rem">
			<div class="line"></div>
			<h1>八、法律管辖和适用</h1>
		</div>
		<p>8.1 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。 </p>
		<p>8.2 如发生本协议条款与上述法律相抵触时，则这些条款将完全按上述法律规定重新解释，但不影响其它合法条款对用户产生的法律效力和影响。</p>
		<p>8.3 本协议的规定是可分割的，如本协议任何规定被裁定为无效或不可执行，则该规定可被删除，不影响其余条款的继续执行。</p>
		<p style="margin-bottom:.3rem">8.4 本协议解释权及修订权归深圳市它途文化有限公司所有。</p>

	</section>	
</div>
</template>

<script>
export default {
  name: 'agreement',
  data () {
    return {
    }
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
.container{
	overflow: auto;
	height: 100%;
	font-family: "微软雅黑";
	-webkit-overflow-scrolling : touch; 
	background-color: #fff
}
.line{
	width: .06rem;
	height: .32rem;
	margin-left: .3rem;
	background-color: #2cc17b;
	border-radius: 3rem;
	margin-right: .16rem;
	float: left;
}
h1{
	font-size: .3rem;
	color: #000;
	margin-bottom: .2rem;
}
section{
	padding-top: .5rem;
	background-color: #fff;
	font-size: .24rem;
}
p{
	margin:0 .3rem 0 .52rem;
	line-height: .38rem;
	color: #888;
}
</style>